In [38]:
import pandas as pd
from datetime import datetime, timedelta
import numpy as np

In [39]:
users_data = {
    'user_id': [1, 2, 3, 4],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
}

transactions_data = {
    'user_id': [1, 2, 2, 3, 3],
    'amount': [100, 200, 150, 50, 120],
    'transaction_date': [
        '2023-12-15', '2023-12-16', '2023-12-10',
        '2023-11-20', '2023-12-12'
    ]
}

# 1. merge on user_id
# 2. find the user_id has not done transaction in last 30 days

In [40]:
users_df = pd.DataFrame(users_data)
users_df

   user_id     name
0        1    Alice
1        2      Bob
2        3  Charlie
3        4    David

In [41]:
transactions_df = pd.DataFrame(transactions_data)
transactions_df

   user_id  amount transaction_date
0        1     100       2023-12-15
1        2     200       2023-12-16
2        2     150       2023-12-10
3        3      50       2023-11-20
4        3     120       2023-12-12

In [42]:
type(transactions_df['transaction_date'][0])

str

In [43]:
transactions_df['transaction_date']= pd.to_datetime(transactions_df['transaction_date'])
type(transactions_df['transaction_date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [44]:
merged_df = users_df.merge(transactions_df, on='user_id', how='left')
# merged_df = users_df.merge(transactions_df, on='user_id', how='right')
# merged_df = users_df.merge(transactions_df, on='user_id')
merged_df

   user_id     name  amount transaction_date
0        1    Alice   100.0       2023-12-15
1        2      Bob   200.0       2023-12-16
2        2      Bob   150.0       2023-12-10
3        3  Charlie    50.0       2023-11-20
4        3  Charlie   120.0       2023-12-12
5        4    David     NaN              NaT

In [68]:
# current_date = datetime.now()
current_date = datetime(2023, 12, 30)
current_date

datetime.datetime(2023, 12, 30, 0, 0)

In [69]:
cutoff_date = current_date - timedelta(days=30)
cutoff_date

datetime.datetime(2023, 11, 30, 0, 0)

In [70]:
recent_transactions = transactions_df[transactions_df['transaction_date'] > cutoff_date]
recent_transactions

   user_id  amount transaction_date
0        1     100       2023-12-15
1        2     200       2023-12-16
2        2     150       2023-12-10
4        3     120       2023-12-12

In [71]:
recent_user_ids = recent_transactions['user_id'].unique()
recent_user_ids

array([1, 2, 3], dtype=int64)

In [74]:
users_df['user_id']

0    1
1    2
2    3
3    4
Name: user_id, dtype: int64

In [73]:
users_df['user_id'].isin(recent_user_ids)

0     True
1     True
2     True
3    False
Name: user_id, dtype: bool

In [75]:
~users_df['user_id'].isin(recent_user_ids)

0    False
1    False
2    False
3     True
Name: user_id, dtype: bool

In [76]:
users_df[~users_df['user_id'].isin(recent_user_ids)]

   user_id   name
3        4  David

In [104]:
users_df[users_df['user_id'].isin(recent_user_ids)]

   user_id     name
0        1    Alice
1        2      Bob
2        3  Charlie

In [105]:
''' ************************************************************************** '''

' ************************************************************************** '

In [109]:
df1 = pd.DataFrame({'id': [1, 2, 3, 4], 'salary': [1000, 2000, 3000, 4000]})
df2 = pd.DataFrame({'id': [1, 5, 3, 4], 'salary': [1000, 5000, 3000, 10000]})

print(df1['id'].isin(df2['id']))

# find deleted columns in df2 ---> 2---2000
deleted_row_in_df2 =df1[~df1['id'].isin(df2['id'])]
print(deleted_row_in_df2)

# find new added columns in df2 ---> 5---5000
deleted_row_in_df1= df2[~df2['id'].isin(df1['id'])]
print(deleted_row_in_df1)

# find updated columns in df2-----> 4---10000
# Find rows in df2 where id exists in df1 but salary is different (updated)
updated_rows = df2[df2['id'].isin(df1['id']) & ~df2['id'].isin(df1[df1['salary'] == df2['salary']] ['id'])]

print(updated_rows)
print(df1['salary'] == df2['salary'])
print(df1[df1['salary'] == df2['salary']] ['id'])
print(df2['id'].isin(df1[df1['salary'] == df2['salary']] ['id']))
print(~df2['id'].isin(df1[df1['salary'] == df2['salary']] ['id']))
print(df2['id'].isin(df1['id']))
print(df2['id'].isin(df1['id'][df1['salary'] == df2['salary']] ))

0     True
1    False
2     True
3     True
Name: id, dtype: bool
   id  salary
1   2    2000
   id  salary
1   5    5000
   id  salary
3   4   10000
0     True
1    False
2     True
3    False
Name: salary, dtype: bool
0    1
2    3
Name: id, dtype: int64
0     True
1    False
2     True
3    False
Name: id, dtype: bool
0    False
1     True
2    False
3     True
Name: id, dtype: bool
0     True
1    False
2     True
3     True
Name: id, dtype: bool
0     True
1    False
2     True
3    False
Name: id, dtype: bool